**Consider the following Python dictionary data and Python list labels:**

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

**1. Create a DataFrame birds from this dictionary data which has the index labels.**

In [115]:
import numpy as np
import pandas as pd
data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes',\
        'spoonbills', 'spoonbills'], 'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4], 'visits': [2, 4,\
          3, 4, 3, 4, 2, 2, 3, 2], 'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
birds = pd.DataFrame(data,index= labels )
birds

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
f      Cranes  3.0       4       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

**2. Display a summary of the basic information about birds DataFrame and its data.**

In [92]:
print ("Summary of Birds DataFrame is: \n",birds.describe())
print ("Top rows of birds data frame: \n",birds.head())
print ("Last rows of data frame is: \n",birds.tail())
print ("Average age of birds is: \n",birds.mean())

Summary of Birds DataFrame is:
             age     visits
count  8.000000  10.000000
mean   4.437500   2.900000
std    2.007797   0.875595
min    1.500000   2.000000
25%    3.375000   2.000000
50%    4.000000   3.000000
75%    5.625000   3.750000
max    8.000000   4.000000
Top rows of birds data frame:
         birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
Last rows of data frame is:
         birds  age  visits priority
f      Cranes  3.0       4       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no
Average age of birds is:
 age       4.4375
visits    2.9000
dtype: float64

**3. Print the first 2 rows of the birds dataframe **

In [93]:
#print ("First two frames of birds data frame: \n",birds.head(2)) one way
print ("First two rows of birds data frame: \n", birds.iloc[0:2])##another way

First two rows of birds data frame:
     birds  age  visits priority
a  Cranes  3.5       2      yes
b  Cranes  4.0       4      yes

**4. Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [94]:
print (birds[['birds','age']])

        birds  age
a      Cranes  3.5
b      Cranes  4.0
c     plovers  1.5
d  spoonbills  NaN
e  spoonbills  6.0
f      Cranes  3.0
g     plovers  5.5
h      Cranes  NaN
i  spoonbills  8.0
j  spoonbills  4.0

**5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']**

In [95]:
birds[['birds', 'age', 'visits']].iloc[[2, 3, 7]]

        birds  age  visits
c     plovers  1.5       3
d  spoonbills  NaN       4
h      Cranes  NaN       2

**6. select the rows where the number of visits is less than 4**

In [96]:
birds[birds['visits'] < 4]

        birds  age  visits priority
a      Cranes  3.5       2      yes
c     plovers  1.5       3       no
e  spoonbills  6.0       3       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

**7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN**

In [97]:
birds[['birds', 'visits']][birds['age'].isnull()]

        birds  visits
d  spoonbills       4
h      Cranes       2

**8. Select the rows where the birds is a Cranes and the age is less than 4**

In [98]:
#birds[birds['birds'] == "Cranes" & birds['age'] < 4]
birds[birds['birds'] == 'Cranes'][birds['age'] < 4]

C:\Users\Vemuri Gnanesh\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.

    birds  age  visits priority
a  Cranes  3.5       2      yes
f  Cranes  3.0       4       no

**9. Select the rows the age is between 2 and 4(inclusive)**

**10. Find the total number of visits of the bird Cranes**

In [110]:
birds['visits'][birds['birds'] == 'Cranes'].sum()

0

**11. Calculate the mean age for each different birds in dataframe.**

In [111]:
birds_g = birds.groupby('birds')
birds_g.mean()

            age  visits
birds
plovers     3.5     2.5
spoonbills  6.0     3.0
trumpeters  3.5     3.0

**12. Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [117]:
birds_c = pd.concat(birds,[[{'birds':'Parrot','age':4,'visits':3,"priority":1}],index = ['f']])
birds_c

SyntaxError: invalid syntax (<ipython-input-117-64d825c154b7>, line 1)

**13. Find the number of each type of birds in dataframe (Counts)**

In [102]:
for bir,birds_df in birds_g:
    print ("No of {bird} are {counts}".format(bird = bir, counts = len(birds_df['birds'])))

No of Cranes are 4
No of plovers are 2
No of spoonbills are 4

**14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.**

In [103]:
print(birds['age'].sort_values())## Sort() will not work for a series object
print ("----====----"*50)
print(birds['visits'].sort_values(ascending = True)) ## By default descending order if ascending= True then ascending
## Reference: https://www.geeksforgeeks.org/python-pandas-series-sort_values/

c    1.5
f    3.0
a    3.5
b    4.0
j    4.0
g    5.5
e    6.0
i    8.0
d    NaN
h    NaN
Name: age, dtype: float64
----====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====--------====----
a    2
g    2
h    2
j    2
c    3
e    3
i    3
b    4
d    4
f    4
Name: visits, dtype: int64

**15. Replace the priority column values with'yes' should be 1 and 'no' should be 0**

In [106]:
birds['priority'][birds['priority'] == 'yes'] = 1
birds['priority'][birds['priority'] == 'no'] = 0
birds

C:\Users\Vemuri Gnanesh\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.
C:\Users\Vemuri Gnanesh\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

        birds  age  visits priority
a      Cranes  3.5       2        1
b      Cranes  4.0       4        1
c     plovers  1.5       3        0
d  spoonbills  NaN       4        1
e  spoonbills  6.0       3        0
f      Cranes  3.0       4        0
g     plovers  5.5       2        0
h      Cranes  NaN       2        1
i  spoonbills  8.0       3        0
j  spoonbills  4.0       2        0

**16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'.**

In [109]:
birds['birds'][birds['birds'] == 'Cranes'] = 'trumpeters'
birds

C:\Users\Vemuri Gnanesh\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

        birds  age  visits priority
a  trumpeters  3.5       2        1
b  trumpeters  4.0       4        1
c     plovers  1.5       3        0
d  spoonbills  NaN       4        1
e  spoonbills  6.0       3        0
f  trumpeters  3.0       4        0
g     plovers  5.5       2        0
h  trumpeters  NaN       2        1
i  spoonbills  8.0       3        0
j  spoonbills  4.0       2        0